
#ifndef _mmsvdsolveunit_h
#define _mmsvdsolveunit_h

#include "ap.h"

/*************************************************************************
Процедура решения системы линейных уравнений с прямоугольной матрицей
методом сингулярного разложения. Алгоритм  ищет решение с минимальной
невязкой.  Матрица системы  может иметь любой ранг.

Система имеет вид:
    Ax = b
где A - матрица MxN, x - вектор Nx1, b - вектор Mx1

Входные параметры:
    A       -   массив с нумерацией элементов [1..M, 1..N+1].
                В столбцах от 1 до N содержится матрица системы,
                В столбце N+1 содержится правая часть b.
    M       -   число уравнений (строк в матрице).
    N       -   число неизвестных (столбцов в матрице)

Выходные параметры:
    Sol     -   массив с нумерацией элементов [1..N].
                Решение.

Результат:
    Если система  имеет единственное решение, то алгоритм возвращает True.
    Если  система  несовместна  или  имеет  бесконечно  много  решений, то
    алгоритм  возвращает  False,  при  этом  в  Sol  находится   наилучшее
    приближение к решению.
*************************************************************************/
bool svdsolve(ap::real_2d_array a, int m, int n, ap::real_1d_array& sol);


#endif
